class LpController < ApplicationController
  def person
    @couponElements = [
      ["1","つぼ八 明大前店", "飲み放題！ 2時間で1500円(税込)"],
      ["3","海鮮居酒屋 はなの舞", "4名以上で1000円割引！"],
      ["6","タピオカ専門店 宣喜茶", "タピオカ半額！"],
      ["10","ガブリチキン", "骨付鳥・親鳥890円が半額！"],
      ["12","インド料理コーヒーヌール", "アルコール1杯99円！"],
      ["16","シーズレシピ", "限定メニュー馬刺し1000円！"]
    ]
      
    if user_signed_in?
      redirect_to("/")
    end
  end
  
  def group
    @couponElements = [
      ["1","つぼ八 明大前店", "飲み放題！ 2時間で1500円(税込)"],
      ["3","海鮮居酒屋 はなの舞", "4名以上で1000円割引！"],
      ["6","タピオカ専門店 宣喜茶", "タピオカ半額！"],
      ["10","ガブリチキン", "骨付鳥・親鳥890円が半額！"],
      ["12","インド料理コーヒーヌール", "アルコール1杯99円！"],
      ["16","シーズレシピ", "限定メニュー馬刺し1000円！"]
    ]
      
    if user_signed_in?
      redirect_to("/")
    end
  end
end
